
export interface PackageDetails {
    inverterOrCharger: string;
    quantity?: string;
    type?: string;
    area?: string;
    suitableFor?: string;
    usage?: string;
    special?: string[];
}
export interface PackageItem {
    id: string;
    title: string;
    subtitle: string;
    //price: string;
    saving?: string;
    details: PackageDetails;

}

export interface AdditionalCost {
    item: string;
    price: string;
}

export interface Conditions {
    freeServices: string[];
    warranties: string[];
    additionalCosts: AdditionalCost[];
    condition: string[];
}



export const solarPackages: PackageItem[] = [
    {
        id: "s1",
        title: "รุ่น 3.3 kW",
        subtitle: "1 Phase",
        //price: "95,000",
        saving: "1,800 - 2,200",
        details: {
            inverterOrCharger: "Solax 3000W",
            quantity: "8 แผง",
            type: "Mono Crystalline 380W",
            area: "16 ตร.ม.",
            suitableFor: "อัตราการใช้ไฟฟ้าเฉลี่ย 10-12 Unit/วัน",
            usage: "เปิดแอร์ได้ 1 ตัว พร้อมเครื่องใช้ไฟฟ้าอื่น",
        },
    },
    {
        id: "s2",
        title: "รุ่น 5 kW",
        subtitle: "1, 3 Phases",
        //price: "145,000",
        saving: "3,000",
        details: {
            inverterOrCharger: "Huawei 5000W",
            quantity: "9-10 แผง",
            type: "Mono Crystalline 540W",
            area: "22-26 ตร.ม.",
            suitableFor: "อัตราการใช้ไฟฟ้าเฉลี่ย 20 Unit/วัน",
            usage: "เปิดแอร์ได้ 2 ตัว พร้อมเครื่องใช้ไฟฟ้าอื่น"
        },

    },
    {
        id: "s3",
        title: "รุ่น 10 kW",
        subtitle: "3 Phases",
        //price: "155,000",
        saving: "6,000",
        details: {
            inverterOrCharger: "Huawei 10000W",
            quantity: "17-20 แผง",
            type: "Mono Crystalline 540W",
            area: "70-72 ตร.ม.",
            suitableFor: "อัตราการใช้ไฟฟ้าเฉลี่ย 35-40 Unit/วัน",
            usage: "เปิดแอร์ได้ 4 ตัว พร้อมเครื่องใช้ไฟฟ้าอื่น",
        },

    },
    {
        id: "s4",
        title: "รุ่น 15 kW",
        subtitle: "3 Phases",
        //price: "265,000",
        saving: "9,000",
        details: {
            inverterOrCharger: "Huawei 15000W",
            quantity: "25 แผง",
            type: "Mono Crystalline 540W",
            area: "105 ตร.ม.",
            suitableFor: "อัตราการใช้ไฟฟ้าเฉลี่ย 35-40 Unit/วัน",
            usage: "เปิดแอร์ 6 ตัว พร้อมเครื่องใช้ไฟฟ้าอื่น",
        },
    },
    {
        id: "s5",
        title: "รุ่น 20 kW",
        subtitle: "3 Phases",
        //price: "265,000",
        saving: "12,000",
        details: {
            inverterOrCharger: "Huawei 20000W",
            quantity: "35-36 แผง",
            type: "Mono Crystalline 555W",
            area: "140-142 ตร.ม.",
            suitableFor: "อัตราการใช้ไฟฟ้าเฉลี่ย 75-80 Unit/วัน",
            usage: "เปิดแอร์ 8 ตัว พร้อมเครื่องใช้ไฟฟ้าอื่น",
        },
    },
    {
        id: "s6",
        title: "รุ่น 30 kW",
        subtitle: "3 Phases",
        //price: "265,000",
        saving: "18,000",
        details: {
            inverterOrCharger: "Huawei 30000W",
            quantity: "55-56 แผง",
            type: "Mono Crystalline 540W",
            area: "200-240 ตร.ม.",
            suitableFor: "อัตราการใช้ไฟฟ้าเฉลี่ย 128 Unit/วัน",
            usage: "เปิดแอร์ 12 ตัว พร้อมเครื่องใช้ไฟฟ้าอื่น",
        },
    },
    {
        id: "s7",
        title: "รุ่น 50 kW",
        subtitle: "3 Phases",
        //price: "265,000",
        saving: "30,000",
        details: {
            inverterOrCharger: "Huawei 50000W",
            quantity: "94-95 แผง",
            type: "Mono Crystalline 540W",
            area: "360-380 ตร.ม.",
            suitableFor: "อัตราการใช้ไฟฟ้าเฉลี่ย 250 Unit/วัน",
            usage: "เปิดแอร์ 20 ตัว พร้อมเครื่องใช้ไฟฟ้าอื่น",
            special: ["MITSUBISHI 9554 BTU"]
        },
    },
    {
        id: "s8",
        title: "รุ่น 100 kW",
        subtitle: "3 Phases",
        //price: "265,000",
        saving: "60,000",
        details: {
            inverterOrCharger: "Huawei 100000W",
            quantity: "186-200 แผง",
            type: "Mono Crystalline 540W",
            area: "700-720 ตร.ม.",
            suitableFor: "อัตราการใช้ไฟฟ้าเฉลี่ย 467 Unit/วัน",
            usage: "เปิดแอร์ 40 ตัว พร้อมเครื่องใช้ไฟฟ้าอื่น",
            special: ["Free Fusion Deambox"]
        },
    },
    {
        id: "s9",
        title: "รุ่น 150 kW",
        subtitle: "3 Phases",
        //price: "265,000",
        saving: "100,000",
        details: {
            inverterOrCharger: "Huawei 200000W",
            quantity: "279-280 แผง",
            type: "Mono Crystalline 540W",
            area: "1,080-1,140 ตร.ม.",
            suitableFor: "อัตราการใช้ไฟฟ้าเฉลี่ย 733 Unit/วัน",
            usage: "เปิดแอร์ 60 ตัว พร้อมเครื่องใช้ไฟฟ้าอื่น",
            special: ["Free Fusion Deambox"]
        },
    }
];

export const solarConditions: Conditions = {
    freeServices: [
        'ฟรี! บริการขออนุญาตขนานไฟกับการไฟฟ้า (MEA/PEA)',
        'ฟรี! บริการแจ้งความประสงค์ติดตั้งโซล่าเซลล์กับ อปท.',
        'ฟรี! บริการสำรวจหน้างานทั่วประเทศ',
        'ฟรี! บริการล้างแผง 2 ครั้ง (ปีละ 1 ครั้ง)',
        'ฟรี! บริการตรวจสอบระบบ 2 ครั้ง (ปีละ 1 ครั้ง)'
    ],
    warranties: [
        'รับประกันประสิทธิภาพแผงโซล่าเซลล์ 25 ปี',
        'รับประกันตัวแผงโซล่าเซลล์ (Product) 12-15 ปี',
        'รับประกัน inverter Huawei 10 ปี',
        'รับประกันงานติดตั้ง 2 ปี'
    ],
    additionalCosts: [
        { item: 'หลังคาพื้นปูน', price: '2.5 บาท/จุด' },
        { item: 'บ้าน/อาคารที่มีความสูงเกิน 2 ชั้น หรือไม่เกิน 10 เมตร', price: '0-250 บาท/เมตร' },
        { item: 'ทำระบบ Ground AC เพิ่ม (กรณีบ้าน/อาคารไม่มีระบบ Ground)', price: '2,000-6,000 บาท' },
        { item: 'เปลี่ยน/ซ่อมแซม หลังคาก่อนดำเนินการติดตั้ง', price: '650 บาท/ตารางเมตร' },
        { item: 'เดินไฟฟ้าภายในบ้าน, อาคาร', price: 'คิดเป็นจุด ๆ ละเริ่มต้นที่ 180 บาท หรือวิเคราะห์ตามหน้างาน' },
        { item: 'ติดตั้งกล้องวงจรปิด', price: 'เริ่มต้นที่ 2,000 หรือวิเคราห์ตามหน้างาน'},
        { item: 'เดินระบบ Network Wifi Lan กระจายจุดเชื่อมต่อ Internet ', price: 'เริ่มต้นที่ 3,000 บาท'},
        { item: 'วิเคราะห์และออกแบบระบบเครือข่าย Smart Home, Smart Farmimg, Smart Office', price: 'เริ่มต้นที่ 20,000 บาท'},
    ],
    condition: [
        'วันเซนต์สัญญาการติดตั้งชำระ 30 % ก่อนเข้างาน 5 - 7 วันทำการ เริ่มการติดตั้ง 50 % และ 20 % เมื่อทำงานแล้วเสร็จประมาณ 3 - 7 วัน',
        'เมื่อแจ้งความประสงค์ในการสำรวจหน้างานติดตั้ง เจ้าหน้าจะติดต่อกลับเพื่อสอบถามข้อมูลเพิ่มเติม ผ่านหมายเลขโทรศัพท์ 02-103-4555 เท่านั้นภายใน 48 ชั่วโมง',
        'ส่วนลดและคะแนนสะสม REST - Points นี้ ไม่สามารถแลกเป็นเงินสดได้',
        'ช่องทางการชำระเงินค่าสินค้าและบริการ ได้แก่ โอนผ่านบัญชีธนาคาร, QR code และการผ่อนชำระผ่านระบบ Ample Smart PoS 0 % นาน 3 ปี',
        'กรณีการผ่อนชำระผ่าน Ample Smart PoS การสั่งซื้อขั้นต่ำที่ผ่อนได้คือ 75,000 - 250,000 บาท หากใช้คูปองเป็นส่วนและราคารวมหากการสั่งซื้อต่ำหรือสูงกว่าที่กำหนดจะไม่สามารถทำการผ่อนชำระได้',
        'กรณีที่ต้องการ Refund เงินคืนสามารถ Refund ได้ภายใน 90 วัน นับแต่วันขอ Refund แต่จะไม่สามารถได้เงินคืนเต็มจำนวน',
    ]
};



export const EVPackages: PackageItem[] = [
    {
        id: "e1",
        title: "สถานีชาร์จ EV สำหรับที่อยู่อาศัย",
        subtitle: "ขนาด 22kW",
        //price: "95,000",
        details: {
            inverterOrCharger: "เครื่องชาร์จไฟฟ้ากระแสสลับ AC",
            area: "ติดตั้งบนผนังหรือขาตั้ง",
            suitableFor: "รองรับความต้องการใช้งานการชาร์จทุกประเภท",
            usage: "เปิดแอร์ได้ 1 ตัว พร้อมเครื่องใช้ไฟฟ้าอื่น",
            special: [
                'รองรับเทคโนโลยี RFID สำหรับยืนยันตัวตนผู้ใช้งาน',
                'สามารถจัดการระยะไกล ด้วย OCPP ทำให้บริหารจัดการผ่านระบบเครือข่ายได้อย่างง่ายดาย',
                'ได้รับมาตรฐานป้องกัน IP55 / IK10 เหมาะสำหรับสภาพแวดล้อมทั้งในร่มและกลางแจ้ง',
                'ประหยัดพลังงาน ใช้พลังงานโหมด Standby ต่ำ'
            ]
        },
    },
    {
        id: "e2",
        title: "สถานีชาร์จ EV สำหรับสำนักงาน",
        subtitle: "ขนาด 25kW",
        //price: "95,000",
        details: {
            inverterOrCharger: "หัวชาร์จเอาท์พุทคู่",
            type: 'พอร์ทชาร์จแบบคู่ CCS / CHAdeMO',
            special: [
                'ประสิทธิภาพพลังงานสูดสุด 94%',
                'รองรับเทคโนโลยี RFID ยืนยันตัวตนผู้ใช้งาน',
                'รองรับระบบบริหารจัดการผ่านเครือข่ายคอมพิวเตอร์ (OCPP 1.5S และ 1.6J)',
                'ประเภท 3R, ได้รับมาตรฐานป้องกัน IP55 และ IK10',
            ]
        },
    },
    {
        id: "e3",
        title: "สถานีชาร์จ EV สำหรับสถานประกอบการ",
        subtitle: "ขนาด 50kW",
        //price: "95,000",
        details: {
            inverterOrCharger: "เครื่องชาร์จไฟฟ้ากระแสตรง DC",
            area: "ติดตั้งบนผนัง",
            type: 'หัวชาร์จคู่',
            special: [
                'ประสิทธิภาพพลังงาน ≧ 96% เพื่อการประหยัดการใช้พลังงาน',
                'OCPP และการเชื่อมต่อเครือข่ายและระบบไร้สายได้อย่างราบรื่น',
                'สามารถชำระเงินผ่านบัตรเครดิต Charge-to-go สำหรับลูกค้า',
                'สามารถชาร์จพร้อมกันในระยะเวลาชาร์จที่สั้นลง'
            ]
        },
    },
    {
        id: "e4",
        title: "สถานีชาร์จ EV สำหรับลานจอดรถ",
        subtitle: "ขนาด 200 kW",
        //price: "95,000",
        details: {
            inverterOrCharger: "การจัดการพลังงานแบบไดนามิกส์",
            type: 'เลือกประเภทหัวชาร์จทั้งสองด้านได้ตามความต้องการ',
            special: [
                'รองรับการชำระเงินด้วยบัตรเครดิตและเทคโนโลยี RFID เพื่อการจัดการผู้ใช้งานที่ง่ายดาย',
                'สายเคเบิล CCS 200kW / 400A ปราศจากระบบระบายความร้อนด้วยของเหลว',
                'เวอร์ชั่นสูงสุดถึง 920V DC',
                'ได้รับตามมาตรฐาน DIN 18040'
            ]
        },
    },
    {
        id: "e5",
        title: "สถานีชาร์จ EV สำหรับปั๊มน้ำมัน",
        subtitle: "ขนาด 350 kW และ 540A",
        //price: "95,000",
        details: {
            inverterOrCharger: "ไฟฟ้ากระแสตรง",
            area: 'ติดตั้งบนผนัง',
            special: [
                'สามารถชาร์จพร้อมกันในระยะเวลาชาร์จที่สั้นลง',
                'สามารถชำระเงินผ่านบัตรเครดิต Charge-to-go สำหรับลูกค้า',
                'ประสิทธิภาพพลังงาน ≧ 96% เพื่อการประหยัดการใช้พลังงาน',
                'มาตรฐาน OCPP และช่วยอำนวยความสะดวกการบริหารจัดการผ่านระบบเครือข่ายคอมพิวเตอร์',
                'อายุการใช้งานยาวนานการปกป้องมาตรฐาน IP55',
                'ประสิทธิภาพพลังงานสูงสุด 95% ช่วยประหยัดพลังงาน',
                'อัพเกรดอย่างง่ายดายเพราะออกแบบเพื่อรองรับอนาคต',
            ]
        },
    },
    {
        id: "e6",
        title: "สถานีชาร์จ EV สำหรับแฟรนไชส์",
        subtitle: "ขนาด 500kW - 1Mkw",
        //price: "95,000",
        details: {
            inverterOrCharger: "ไฟฟ้ากระแสตรง",
            area: 'ติดตั้งบนผนัง',
            special: [
                'สามารถชาร์จพร้อมกันในระยะเวลาชาร์จที่สั้นลง',
                'สามารถชำระเงินผ่านบัตรเครดิต Charge-to-go สำหรับลูกค้า',
                'ประสิทธิภาพพลังงาน ≧ 96% เพื่อการประหยัดการใช้พลังงาน',
                'มาตรฐาน OCPP และช่วยอำนวยความสะดวกการบริหารจัดการผ่านระบบเครือข่าย FinTech',
                'อายุการใช้งานยาวนานการปกป้องมาตรฐาน IP55',
                'ประสิทธิภาพพลังงานสูงสุด 95% ช่วยประหยัดพลังงาน',
                'อัพเกรดอย่างง่ายดายเพราะออกแบบเพื่อรองรับอนาคต',
            ]
        },
    },

]

export const EVConditions: Conditions = {
    freeServices: [
        'ฟรี! บริการขออนุญาตขนานไฟกับการไฟฟ้า (MEA/PEA)',
        'ฟรี! บริการแจ้งความประสงค์ติดตั้งโซล่าเซลล์กับ อปท.',
        'ฟรี! บริการสำรวจหน้างานทั่วประเทศ',
        'ฟรี! บริการล้างแผง 2 ครั้ง (ปีละ 1 ครั้ง)',
        'ฟรี! บริการตรวจสอบระบบ 2 ครั้ง (ปีละ 1 ครั้ง)'
    ],
    warranties: [
        'รับประกันประสิทธิภาพ 25 ปี',
        'รับประกันหัวชาร์จ 12-15 ปี',
        'รับประกันสถานี 10 ปี',
        'รับประกันงานติดตั้ง 2 ปี'
    ],
    additionalCosts: [
        { item: 'หลังคาพื้นปูน', price: '2.5 บาท/จุด' },
        { item: 'บ้าน/อาคารที่มีความสูงเกิน 2 ชั้น หรือไม่เกิน 10 เมตร', price: '0-250 บาท/เมตร' },
        { item: 'ทำระบบ Ground AC เพิ่ม (กรณีบ้าน/อาคารไม่มีระบบ Ground)', price: '2,000-6,000 บาท' },
        { item: 'เปลี่ยน/ซ่อมแซม หลังคาก่อนดำเนินการติดตั้ง', price: '650 บาท/ตารางเมตร' },
        { item: 'เดินไฟฟ้าภายในบ้าน, อาคาร', price: 'คิดเป็นจุด ๆ ละเริ่มต้นที่ 180 บาท หรือวิเคราะห์ตามหน้างาน' },
        { item: 'ติดตั้งกล้องวงจรปิด', price: 'เริ่มต้นที่ 2,000 หรือวิเคราห์ตามหน้างาน'},
        { item: 'เดินระบบ Network Wifi Lan กระจายจุดเชื่อมต่อ Internet ', price: 'เริ่มต้นที่ 3,000 บาท'},
        { item: 'วิเคราะห์และออกแบบระบบเครือข่าย Smart Home, Smart Farmimg, Smart Office', price: 'เริ่มต้นที่ 20,000 บาท'},
    ],
    condition: [
        'วันเซนต์สัญญาการติดตั้งชำระ 30 % ก่อนเข้างาน 5 - 7 วันทำการ เริ่มการติดตั้ง 50 % และ 20 % เมื่อทำงานแล้วเสร็จประมาณ 3 - 7 วัน',
        'เมื่อแจ้งความประสงค์ในการสำรวจหน้างานติดตั้ง เจ้าหน้าจะติดต่อกลับเพื่อสอบถามข้อมูลเพิ่มเติม ผ่านหมายเลขโทรศัพท์ 02-103-4555 เท่านั้นภายใน 48 ชั่วโมง',
        'ส่วนลดและคะแนนสะสม REST - Points นี้ ไม่สามารถแลกเป็นเงินสดได้',
        'ช่องทางการชำระเงินค่าสินค้าและบริการ ได้แก่ โอนผ่านบัญชีธนาคาร, QR code และการผ่อนชำระผ่านระบบ Ample Smart PoS 0 % นาน 3 ปี',
        'กรณีการผ่อนชำระผ่าน Ample Smart PoS การสั่งซื้อขั้นต่ำที่ผ่อนได้คือ 75,000 - 250,000 บาท หากใช้คูปองเป็นส่วนและราคารวมหากการสั่งซื้อต่ำหรือสูงกว่าที่กำหนดจะไม่สามารถทำการผ่อนชำระได้',
        'กรณีที่ต้องการ Refund เงินคืนสามารถ Refund ได้ภายใน 90 วัน นับแต่วันขอ Refund แต่จะไม่สามารถได้เงินคืนเต็มจำนวน',
    ]

}